from abc import ABC


class АбстрактнийВоїн(ABC):
    def __init__(self, імя: str):
        self.імя = імя


class АбстракнтаЗброя:
    name: str
    damage: int


class Воїн(АбстрактнийВоїн):
    це_моє_поле = "Привіт світ!"

    def дістати_ніж(self) -> АбстракнтаЗброя:
        return Ніж()


class Ніж(АбстракнтаЗброя):
    назва: str = 'Ніж'
    урон = 10


class Орк:
    здоровя = 10

    def __init__(self, імя: str):
        self.імя = імя

    def вдарити(self, зброя: АбстракнтаЗброя):
        print(f'Орк з ім`ям {self.імя} був вражений зброєю {зброя.назва}!')
        self.здоровя -= зброя.урон


воїн = Воїн('Олексій')
орк = Орк('Ваня')
орк.вдарити(зброя=воїн.дістати_ніж())
